{
  "aboutMe": "Обо мне",
  "introduction": "Вступление",
  "hiIm": "Привет, Я",
  "AbrorXoliqov": "Холиков Аброр",
  "apassionatesoftwareengineer": "инженер програмного обеспечения",
  "developer": "разработчик",
  "withastrongbackgroundinwebdevelopmentandakeeninterestinnewtechnologies.": "с уверенным опытом в веб-разработке и большим интересом к новым технологиям.",
  "background": "Общая информация",
  "I am a student at the National University of Uzbekistan Tashkent. I have worked on various projects, both independently and as part of a team, and I am currently employed at": "Я студент Национального университета Узбекистана в Ташкенте. Я работал над различными проектами как самостоятельно, так и в команде, и в настоящее время я работаю в",
  ". Down below you can see photos of my university and office.": ". Ниже вы можете посмотреть на фотографии моего университета и офиса.",
  "studyJourney": "Начало моего пути в програмирование",
  "My programming journey began on ": "Мой путь к програмированию начался в ",
  "January 12, 2024": "Январе 12, 2024 года",
  ". Without access to offline courses or a personal teacher, I relied solely on": ". Без доступа к офлайн-курсам или личному преподавателю, я полностью полагался только на",
  "lessons to learn programming. I faced and overcame numerous challenges. This experience not only honed my problem-solving skills but also instilled a strong sense of resilience and self-discipline, setting me apart from other applicants. In addition, I have taken IELTS in 2023 year studying on my own too, score you can see below in the photo.": "уроки для изучения программирования. Я столкнулся и преодолел множество препятствий. Этот опыт не только отточил мои навыки решения проблем, но и привил мне сильное чувство упорства и самодисциплины, выделяя меня среди других кандидатов. Кроме того, я сдал IELTS в 2023 году, изучая самостоятельно, результат можно увидеть на фото ниже.",
  "skills": "Навыки",
  "I am proficient in HTML, CSS, JavaScript, and have experience with frameworks and libraries like React, Redux and React-query. I am also familiar with TypeScript, Git, and various development tools.": "Я владею HTML, CSS, JavaScript и имею опыт работы с фреймворками и библиотеками, такими как React, Redux и React-query. Также я знаком с TypeScript, Git и различными инструментами разработки.",
  "currentWork": "Текущая работа",
  "Currently, I am working on several personal projects, exploring new technologies like Vue.js and Next js, and contributing to open source projects.": "В настоящее время я работаю над несколькими личными проектами, изучаю новые технологии, такие как Vue.js и Next.js, а также вношу вклад в проекты с открытым исходным кодом.",
  "hobbiesAndInterests": "Хобби и интересы",
  "In my free time, I enjoy coding and reading tech blogs. I also love traveling and exploring new cultures.": "В свободное время я наслаждаюсь программированием и чтением технических блогов. Также я люблю путешествовать и изучать новые культуры.",
  "contact": "Связаться со мной",
  "Feel free to reach out to me via email at ": "Не стесняйтесь связаться со мной по электронной почте: ",
  " or connect with me on social media:": "также вы можете найти меня в соц. сетях: ",
  "Hi, my name is": "Привет, меня зовут",
  "I build client-side servers.": "Я создаю серверы для клиентской части.",
  "I am a Front-end developer specializing in building client-side websites with logic. Currently, I am looking for opportunities in this field!": "Я фронтенд-разработчик, специализирующийся на создании веб-сайтов с логикой на стороне клиента. В настоящее время ищу возможности в этой области!",
  "If you are interested in my works,": "Если вам интересно обо мне и моих работах,",
  "let's start!": "тогда погнали!",
  "Home": "Главная",
  "About": "Обо мне",
  "Experience": "Опыт",
  "Works": "Проекты",
  "Contact": "Контакт",
  "Education / Experience": "Образование / Опыт",
  "Education": "Образование",
  "School №1": "Общеоб. школа №1",
  "English": "Английский",
  "National University of Uzbekistan Tashkent": "Национальный Университет Узбекистана Ташкент",
  "Programming / Software Engineering at home": "Програмирование самоучка",
  "continuing": "по настоящее время",
  "Job at etc.uz (IST Telekom)": "Трудоустройство в etc.uz (IST Telekom)",
  "Working on PET-projects": "Работа над PET-проекты",
  "Programming Languages:": "Языки програмирования:",
  "Frameworks & Libraries:": "Фреймворки & Библиотекам:",
  "Tools & Platforms:": "Инструменты & Платформы:",
  "Other Skills:": "Другие Навыки:",
  "English C1": "Английский C1",
  "Problem-solving, Team collaboration, Friendly, Polite, Tolerable, Cognitive thinking, Thankful and etc.": "Решение проблем, совместная работа в команде, дружелюбный, вежливый, терпиливый, когнитивное мышление, благодарность и т.д.",
  "Currently Learning / Planning to Learn": "Изучаю в данный момент / Планирую изучить",
  "Current Learning:": "В данный момент изучаю:",
  "Planning to Learn:": "Планирую изучить:",
  "contactForm": "Контактная форма",
  "name": "Имя",
  "phone": "Телефон",
  "email": "Эл. почта",
  "message": "Сообщение",
  "submit": "Отправить",
  "showContactDetails": "Показать контактные данные",
  "returnToContactForm": "Вернуться к контактной форме",
  "myContactDetails": "Мои контактные данные",
  "uzbekistan": "Узбекистан, Ташкент",
  "downloadCV": "Скачать резюме",
  "appName": "Простое приложение калькулятор",
  "headerTitle": "Простое приложение калькулятор",
  "mainTitle": "Калькулятор №1",
  "description": "Основной стиль дизайна html/css с чистым <b className=\"text-red-500\">React Js</b>",
  "tryAppLink": "Попробуйте это приложение по этой ссылке",
  "featuresDescription": "С чистым и удобным интерфейсом вы можете быстро складывать, вычитать, умножать и делить числа с легкостью. Приложение также поддерживает десятичные числа и базовые функции памяти, что делает его универсальным для различных расчетных нужд.",
  "codeTitle": "Вот основная функциональность кода калькулятора:",
  "clickToSeeCode": "Нажмите, чтобы увидеть код ",
  "checkCodeLink": "Или вы можете посмотреть код через",
  "backButton": "НАЗАД",
  "appName2": "Приложение для поиска фильмов",
  "headerTitle2": "Приложение для поиска фильмов",
  "mainTitle2": "#2 Приложение для поиска фильмов.",
  "description2": "Более сложный стиль дизайна html/css с чистым <b className='text-red-500'>React Js</b>",
  "tryAppLink2": "Попробуйте это приложение по этой ссылке",
  "featuresDescription2": "Это был мой первый крупный проект, который я создал за 1 месяц учебы. Как видите, это не сложный проект. Просто чтобы показать свои навыки получения данных ;)",
  "headerTitle3": "Приложение для блога",
  "blogAppNumber3": "#3 Приложение для блога.",
  "description3": "Сложный дизайн с прочным",
  "reactJs": "React Js с использованием Redux, Redux/toolkit, Tailwind и т. д.",
  "tryAppLink3": "Попробуйте это приложение сами с помощью этой ссылки",
  "discoverProject": "Итак, это следующий крупный проект, который занял неделю или даже больше для завершения. Конечно, я признаюсь, что это не была моя идея проекта, так как я делал это по видео на YouTube. Из этого проекта я открыл для себя",
  "githubLinkText": "Вы можете проверить код через",
  "backButtonText": "BACK",
  "much more": "многое другое",
  "header": "Игра Виселица🎯",
  "blogAppNumber4": "#4 Игра Веселица.",
  "app_description": "Приложение с чистым",
  "try_app": "Попробуйте это приложение сами по этой ссылке",
  "game_description": "Простая игра для практики TypeScript. Это был мой первый проект с использованием ",
  "check_code": "Вы можете проверить код здесь",
  "see_code": "Нажмите, чтобы увидеть код",
  "back_button": "НАЗАД",
  "A Note App": "Приложение для заметок",
  " #5 Note App.": " #5 Приложение для заметок.",
  "This app is like a note tool where you can set time and city you visited and rate it or comment. There is even a GPS for defining your current position.A complete design with solid": "Это приложение похоже на инструмент для заметок, где вы можете устанавливать время и город, который вы посетили, и оценивать его или комментировать. Здесь даже есть GPS для определения вашего текущего положения. Полный дизайн с прочным",
  "React Js using React query, Styled components and etc": "React Js с использованием React query, Styled components и т. д.",
  "So, it was the next one of complicated project which took more than a two weeks to complete. Of course, ": "Итак, это был следующий сложный проект, который занял более двух недель для завершения. Конечно же, ",
  "I admit it was not my idea of the project since I did this following YouTube video": "Я признаю, что это не была моя идея проекта, так как я сделал его после просмотра этого видео на YouTube",
  "From this project, I discovered ": "Из этого проекта я узнал ",
  "A Hotel guests App": "Приложение для гостей отеля",
  "#5 Hotel App": "#5 Приложение для отеля",
  "This app helps hotel staff to monitor guests in the hotel since it provides useful tools. There are charts and statistics for regulating guests income and outcome. A fully complex design with solid": "Это приложение помогает персоналу отеля отслеживать гостей в отеле, так как оно предоставляет полезные инструменты. Есть диаграммы и статистика для регулирования доходов и расходов гостей. Полностью сложный дизайн с прочным",
  "I made this app with the help of YouTube teachers and GPT. It has lots of functionalities as you can see by clicking on the link below.": "Я сделал это приложение с помощью учителей с YouTube и GPT. У него много функций, как вы можете видеть, перейдя по ссылке ниже.",
  "Just to remind, I started studying programming from zero in 2024 in January, so within 3 months I managed to make such app": "Просто напомню, что я начал изучать программирование с нуля в январе 2024 года, поэтому за 3 месяца я смог сделать такое приложение",
  "From this project, I strenghtened skills at": "Из этого проекта я улучшил навыки в",
  "A Data base App": "Приложение для базы данных",
  "#7 Docs data-base App": "#7 Приложение для базы данных документов",
  "This app helps organise docs more properly and there is a math set inside this App, so you will not need a calculator. Moreover, the app provides search and filter tools to facilitate your job. A fully complex design with solid": "Это приложение помогает организовать документы более эффективно, а внутри есть математический набор, так что вам не понадобится калькулятор. Кроме того, приложение предоставляет инструменты поиска и фильтрации для облегчения вашей работы. Полностью сложный дизайн с надежными функциями.",
  "React TS using React query, Recharts js, Tailwind and etc": "React TS с использованием React query, Recharts js, Tailwind и т. д.",
  " From that time I had been hired to the company ": " С того момента как меня наняли в компанию ",
  "Only after Abror's permission you can access to this app!": "Только после разрешения Аброра вы сможете получить доступ к этому приложению!",
  "Portfolio App": "Портфолио приложение",
  "#8 Portfolio App": "#8 Портфолио приложение",
  "This app totally done by Abror. It used the most recent tools & libraries. Moreover, the app has an access to back-end via Supabase (PostgreSQL). A fully complex design with solid": "Это приложение полностью разработано Аброром. Оно использует самые последние инструменты и библиотеки. Кроме того, приложение имеет доступ к бэк-энду через Supabase (PostgreSQL). Полностью сложный дизайн с надежными функциями.",
  "React TS using React query, Swiper, Tailwind and etc": "React TS с использованием React query, Swiper, Tailwind и т. д.",
  "I need a job which is connected with front-end development. So,I created my first portfolio website, I hope you liked it. I can understand if it seems too simple or with bags (if you notice any, you can leave a message in contact form). From this project, I strenghtened skills at": "Мне нужна работа, связанная с разработкой фронт-энда. Поэтому я создал свой первый сайт-портфолио, надеюсь, вам понравилось. Я понимаю, если он кажется слишком простым или содержит ошибки (если вы заметили что-то, вы можете оставить сообщение в форме обратной связи). Этот проект помог мне укрепить навыки в",
  "Projects / Portfolio": "Проекты / Портфолио",
  "Languages & Techs used": "Языки & Технологии использованы"
}
